[
  [
    "1/1/1972",
    "",
    "Jordan joins Cranston's banking staff",
    "Would later become chief banking aide",
    [
      "Jordan",
      "Cranson"
    ],
    ""
  ],
  [
    "1/1/1978",
    "",
    "Sedlmayr begins working for DeConcini full time",
    "",
    [
      "Sedlmayr",
      "DeConcini"
    ],
    ""
  ],
  [
    "1/1/1978",
    "",
    "Jacobson starts working for Cranston (on Senate staff)",
    "",
    [
      "Jacobson",
      "Cranston"
    ],
    ""
  ],
  [
    "1/1/1981",
    "",
    "DeConcini meets Keating for the first time at a party",
    "",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "1/1/1981",
    "",
    "McCain meets Keating for the first time",
    "At the Navy League dinner",
    [
      "McCain",
      "Keating"
    ],
    ""
  ],
  [
    "8/5/1981",
    "",
    "DeConcini endorces Keating for Bahamas ambassadorship in letter to President",
    "",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "1/1/1982",
    "",
    "Keating gives money to McCain's 1st House campaign",
    "",
    [
      "Keating",
      "McCain"
    ],
    ""
  ],
  [
    "1/1/1982",
    "",
    "DeConcini asks Keating to help with fundraising for his '82 Senate campaign",
    "",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "3/24/1983",
    "",
    "Ed Gray becomes Chariman of the FHLBB",
    "",
    [
      "Gray",
      "FHLBB"
    ],
    ""
  ],
  [
    "1/1/1984",
    "",
    "Keating gives money to McCain's 2nd House campaign",
    "",
    [
      "Keating",
      "McCain"
    ],
    ""
  ],
  [
    "1/1/1984",
    "",
    "DeConcini's office (Sedlmayr) starts dealing with Keating",
    "Sending messages to other Senators on his behalf",
    [
      "DeConcini",
      "Sedlmayr",
      "Keating"
    ],
    ""
  ],
  [
    "1/1/1984",
    "",
    "Jacobson leaves Senate staff and becomes \"Fundraising Coordinator\" for Cranston",
    "",
    [
      "Cranston",
      "Jacobson"
    ],
    ""
  ],
  [
    "1/2/1984",
    "",
    "Keating arranges for contributions to retire Glenn's '84 presidential debt",
    "",
    [
      "Keating",
      "Glenn"
    ],
    ""
  ],
  [
    "1/9/1984",
    "",
    "McCain meets with Keating socially in Phoenix",
    "",
    [
      "Keating",
      "McCain"
    ],
    ""
  ],
  [
    "6/21/1984",
    "",
    "Sedlmayr prepares letter to Gray requesting delay of new regulations",
    "",
    [
      "Sedlmayr",
      "DeConcini",
      "Gray"
    ],
    ""
  ],
  [
    "6/23/1984",
    "",
    "Glenn sends letter to Gray re:dissatisfaciton w/Direct Investment law.",
    "",
    [
      "Glenn",
      "Gray"
    ],
    ""
  ],
  [
    "7/16/1984",
    "7/19/1984",
    "Cranston and Jacobson meets Grogan at Democratic National Convention",
    "Grogan says Keating could help clear Cranston's presidential bid bebt (they later later send $10,000 in individual contributions)",
    [
      "Keating",
      "Grogan",
      "Cranston",
      "Jacobson"
    ],
    ""
  ],
  [
    "12/13/1984",
    "",
    "Cranston, Jordan, and Grogan meet re: possible \"direct investment\" laws",
    "FHLBB was thinking of regulating the amount of investment thrifts could directly make in real estate ventures following the S&L deregulation law",
    [
      "Cranston",
      "Jordan",
      "Grogan"
    ],
    ""
  ],
  [
    "12/17/1984",
    "",
    "Attends meeting with Alan Greenspan, Grogan, and Cranston",
    "Greenspan does investigation of Lincoln and endorses their \"direct investment\" practices",
    [
      "Greenspan",
      "Grogan",
      "Cranston"
    ],
    ""
  ],
  [
    "12/17/1984",
    "",
    "Alan Greenspan visit's Glenn's office",
    "Updates Glenn on his investigation and endorsement of Lincoln (unkown if Grogan was there)",
    [
      "Greenspan",
      "Glenn"
    ],
    ""
  ],
  [
    "12/17/1984",
    "",
    "Glenn sends further letter to Gray re: dissatisfaciton with possible \"direct investment\" laws",
    "",
    [
      "Glenn",
      "Gray"
    ],
    ""
  ],
  [
    "1/1/1985",
    "",
    "DeConcini asks Keating to serve on Finance Committee of his '88 reelection campaign",
    "",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "1/30/1985",
    "",
    "FHLBB promulgates \"direct investment\" rule",
    "Under the new rule, effective April 16, the amount of direct investment that a thrift would be allowed to make will be tied to its net worth. Formerly, institutions with a relatively low level of net worth could make direct investment up to 10% of net assets without obtaining regulatory approval",
    [
      "FHLBB"
    ],
    ""
  ],
  [
    "2/5/1985",
    "",
    "Media: Everything's Black and White When It Comes to Ed Gray",
    "Mortgage-industry insiders are still talking about the performance that savings and loan regulatory czar Edwin J. Gray gave last March before a prestigious group of about 100 industry executives regarding \"direct investment\" laws.",
    [
      "Media"
    ],
    ""
  ],
  [
    "4/9/1985",
    "",
    "Keating and Grogan organize a fundraiser for Cranston",
    "$15,000 is raised",
    [
      "Keating",
      "Grogan",
      "Cranston"
    ],
    ""
  ],
  [
    "7/1/1985",
    "",
    "DeConcini writes letters to the Treasury Secretary re: various complaints about Gray",
    "Write Keating and lets him know that he has made these complaints",
    [
      "DeConcini",
      "Gray",
      "Keating"
    ],
    ""
  ],
  [
    "7/10/1985",
    "",
    "Keating contributes to a political action committee (PAC) that Glenn is the spokesman for",
    "$200,000 ",
    [
      "Keating",
      "Glenn"
    ],
    ""
  ],
  [
    "12/1/1985",
    "",
    "Keating attempts to hire Gray out of regulatory role (as FHLBB Chairman)",
    "Gray reports Keating to the Justice Department",
    [
      "Keating",
      "Gray"
    ],
    ""
  ],
  [
    "1/1/1986",
    "",
    "Keating becomes \"significant\" contributer to Cranston",
    "In aide Jacobson's opinion",
    [
      "Keating",
      "Cranston",
      "Jacobson"
    ],
    ""
  ],
  [
    "1/1/1986",
    "",
    "Keating gives money to McCain's 1st Senate campaign",
    "Keating offers to raise more, but McCain declines. Over four campaigns, Keating will contribute $4,000 personally with $112,000 coming from family and friends",
    [
      "Keating",
      "McCain"
    ],
    ""
  ],
  [
    "2/1/1986",
    "",
    "Jacobson starts $300,000 line of credit from Lincoln",
    "To finance Cranston's '86 re-election campaign. Cranston faced a campaign debt of $2 million from his '84 presidential campaign and had to quickly gear up for an expensive and competitive re-election battle in '86",
    [
      "Lincoln",
      "Jacobson",
      "Cranston"
    ],
    ""
  ],
  [
    "2/2/1986",
    "",
    "Keating again contributes to a political action committee (PAC) that Glenn is the spokesman for",
    "$100,000 ",
    [
      "Keating",
      "Glenn"
    ],
    ""
  ],
  [
    "3/15/1986",
    "",
    "Riegle meets Keating at the opening of his Detroit Ponchetrain Hotel",
    "Glenn tells Riegle to go and meet Keating as a potential funder. They do not talk about Lincoln's problems",
    [
      "Riegle",
      "Glenn",
      "Keating"
    ],
    ""
  ],
  [
    "4/2/1986",
    "",
    "Keating asks Glenn to support nomination of Lee Henkel to Bank Board",
    "Glenn refuses",
    [
      "Keating",
      "Glenn",
      "FHLBB"
    ],
    ""
  ],
  [
    "4/29/1986",
    "",
    "Media: Earnings, Revenue Rise 30% for Lincoln Savings",
    "",
    [
      "Media"
    ],
    ""
  ],
  [
    "5/11/1986",
    "",
    "Media: FHLBB's Gray Fights On; S&L Officials No Longer Pressing for His Resignation",
    "The chairman of the Federal Home Loan Bank Board, ankle-deep in rumors that he would announce his resignation, stood at a lectern in Dallas last November while looking across an audience of the thrift industry's top executives.",
    [
      "Media"
    ],
    ""
  ],
  [
    "6/1/1986",
    "",
    "DeConcini recomends Henkel to be on the FHLBB",
    "Keating suggests him, DiConcini writes Riegle about it. Sedlmayr notes these requests are unusal",
    [
      "DeConcini",
      "Keating",
      "Riegle",
      "Sedlmayr",
      "FHLBB"
    ],
    ""
  ],
  [
    "6/2/1986",
    "",
    "Keating asks Glenn to support the nomination of Daniel Manion",
    "Glenn refuses",
    [
      "Keating",
      "Glenn",
      "FHLBB"
    ],
    ""
  ],
  [
    "7/16/1986",
    "",
    "Keating, Grogan, and Riegle meet briefly re: ACC",
    "",
    [
      "Riegle",
      "Keating",
      "Grogan"
    ],
    ""
  ],
  [
    "7/21/1986",
    "",
    "McCain writes Gray about delaying implementation of \"direct investment\" regulation",
    "",
    [
      "McCain",
      "Gray"
    ],
    ""
  ],
  [
    "7/27/1986",
    "",
    "Media: EARNINGS; Lincoln S&L Reports 50% Income Drop",
    "Lincoln Savings & Loan Assn. reported that its net income for the second quarter fell more than 50% to $11.9 million from $24.1 million in the same quarter last year. Revenues in the quarter rose 38.7% to $193.8 million from $139.7 million in last.",
    [
      "Media"
    ],
    ""
  ],
  [
    "8/1/1986",
    "",
    "DeConcini recieves checks raised by Keating",
    "Totals $16,000. DeConcini says he is aware of these only after the '86 election",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "8/20/1986",
    "",
    "Keating, Grogan, and Riegle meet re: Henkel nomination",
    "",
    [
      "Riegle",
      "Keating",
      "Grogan",
      "FHLBB"
    ],
    ""
  ],
  [
    "9/1/1986",
    "",
    "Sedlmayr becomes aware of Keating's trouble with the Bank Board",
    "Because of media on the matter",
    [
      "Sedlmayr"
    ],
    ""
  ],
  [
    "9/15/1986",
    "",
    "Media: FHLBB Officials' Special Treatment Probed",
    "Four top officials of the Federal Home Loan Bank Board are receiving special treatment that gives two of them salaries that are thousands of dollars above the federal pay cap and provides the other two with job security unavailable to most top officials.",
    [
      "Media"
    ],
    ""
  ],
  [
    "9/25/1986",
    "",
    "Cirona Report is issued (Gray has access to this)",
    "Outlines in great detail all the problems that the FHLB-SF had with ACC. Contentious because Gray's statement at the first meeting of \"I don't know anything\" is a sham",
    [
      "SF Regulators",
      "Gray"
    ],
    ""
  ],
  [
    "11/1/1986",
    "",
    "FSLIC recapitalization bill is stopped in Congress by Speaker Wright",
    "Signals to Bank Board that Congressional consent will be key to future regulatory efforts",
    [
      "Wright",
      "FHLBB"
    ],
    ""
  ],
  [
    "11/4/1986",
    "",
    "Jacobson meets with Keating on Election Night",
    "",
    [
      "Jacobson",
      "Keating"
    ],
    ""
  ],
  [
    "11/4/1986",
    "",
    "Media: Lincoln Savings Reports 70% Gain in Profit for Third Quarter",
    "",
    [
      "Media"
    ],
    ""
  ],
  [
    "12/3/1986",
    "",
    "Media: Gray Reimbursed Home Loan Banks for Wife's Travels",
    "Federal Home Loan Bank Board Chairman Edwin J. Gray on Tuesday made public hundreds of pages of his expense and travel records for meetings ranging from Florida to Hawaii, along with a memo saying that the furor over payment of his wife's travel expenses should subside as he always repaid voluntarily.",
    [
      "Media"
    ],
    ""
  ],
  [
    "12/8/1986",
    "",
    "Media: Bank Board Lived Well Off S&Ls; Industry Picked Up Tab for Cruises, Gifts, Alcohol, Limousines - Bank Board's Expenses Disclosed",
    "",
    [
      "Media"
    ],
    ""
  ],
  [
    "12/11/1986",
    "",
    "DeConcini sends Sedlmayr memo about putting pressure on Gray",
    "Evidence that they want to get rid of him well before the April meetings",
    [
      "DeConcini",
      "Sedlmayr"
    ],
    ""
  ],
  [
    "12/16/1986",
    "",
    "Sedlmayr advises DeConcini to \"stay out of\" the Gray/Keating feud",
    "Via memo",
    [
      "DeConcini",
      "Sedlmayr"
    ],
    ""
  ],
  [
    "1/2/1987",
    "",
    "Jacobson sends memo to Cranston re: legislative matters of contributors",
    "",
    [
      "Jacobson",
      "Cranston"
    ],
    "#16"
  ],
  [
    "1/7/1987",
    "",
    "Media: Bank Board Appointee Faces Conflict Charge; Proxmire Opposes Henkel for S&L Ties; Bank Board Appointee Faces Conflict Charge by Proxmire",
    "Lee Henkel, who joined the Federal Home Loan Bank Board two months ago via a recess appointment by President Reagan, is embroiled in a conflict-of-interest charge that lies at the heart of a fight over control of the Bank Board and ultimately the future of the ailing S&L industry.",
    [
      "Media"
    ],
    ""
  ],
  [
    "1/8/1987",
    "",
    "Media: Henkel Denies Conflict in His S&L Proposal",
    "\"At Mr. Henkel's first Board meeting, on Dec. 18, the board rejected a proposal by its Chairman, Edwin J. Gray, to extend for two years a rule limiting a thrift institution's direct real estate investments to 10 percent of its assets.\nMr. Henkel then proposed a more liberal plan that included exempting certain thrift institutions from the retroactive impact of the rule. His plan was also voted down. After the meeting, staff members said privately that only two institutions, one of them Lincoln Savings, would have benefited from the Henkel plan.\"",
    [
      "Media"
    ],
    ""
  ],
  [
    "1/28/1987",
    "",
    "Riegle meets with Keating and Grogan in Washington",
    "Fundraising event on Riegle's behalf is discussed (possibly at the Ponchetrain Hotel, where Keating was investing in another tower)",
    [
      "Keating",
      "Grogan",
      "Riegle"
    ],
    ""
  ],
  [
    "1/28/1987",
    "",
    "Glenn meets with Attchison to discuss investigation of Keating",
    "Glenn sets this up to substantiate Lincoln's claim that regulators are abusing them and their request for Glenn to talk to them",
    [
      "Glenn",
      "Attchison"
    ],
    ""
  ],
  [
    "2/5/1987",
    "",
    "McCain goes to Riegle's office to talk about the Gray/Keating feud",
    "",
    [
      "McCain",
      "Riegle"
    ],
    ""
  ],
  [
    "2/22/1987",
    "",
    "Media: Lincoln S&L Holds Position as No. 2 in Orange County",
    "",
    [
      "Media"
    ],
    ""
  ],
  [
    "2/24/1987",
    "",
    "America Votes discloses Keating donated $100,000 to start it up",
    "Check sent on Mar. 3. Jacobson keeps Grogan up-to-date with PAC's activity",
    [
      "Keating",
      "Jacobson",
      "Grogan"
    ],
    ""
  ],
  [
    "2/25/1987",
    "",
    "Letter sent to Jacobson from Grogan re: desire for Gray's dismissal",
    "Grogan wants their advice on the matter. Jacobson says she doesn't remember seeing it",
    [
      "Grogan",
      "Jacobson"
    ],
    ""
  ],
  [
    "2/25/1987",
    "",
    "Grogan sends letter to Riegle, Jacobson, and Jordan asking for advice about Petition for Disqualification for Gray",
    "",
    [
      "Grogan",
      "Jacobson",
      "Jordan",
      "Riegle"
    ],
    ""
  ],
  [
    "2/26/1987",
    "",
    "Grogan and Attchison go to Washington to lobby support for \"direct investment\" deregulation.",
    "Meets with McCain and Riegle",
    [
      "Grogan",
      "Attchison",
      "McCain",
      "Riegle"
    ],
    ""
  ],
  [
    "3/1/1987",
    "",
    "Lincoln files lawsuit against \"direct investment\" laws",
    "Lincoln loses",
    [
      "Lincoln"
    ],
    ""
  ],
  [
    "3/1/1987",
    "",
    "Keating calls DeConcini and asks him to set up meeting re: issues with Gray",
    "Not the only time DeConcini had been contacted re: Gray. DeConcini thinks it was a good idea",
    [
      "Keating",
      "DeConcini"
    ],
    ""
  ],
  [
    "3/1/1987",
    "",
    "Riegle talks to McCain on Senate floor re: Keating's issues",
    "They go to Riegle's office after to discuss",
    [
      "Riegle",
      "McCain"
    ],
    ""
  ],
  [
    "3/2/1987",
    "",
    "AZ League of Savings and Loans Association issues complaint to VanPaasschen re: \"direct investment\" laws",
    "",
    [
      "VanPaasschen"
    ],
    ""
  ],
  [
    "3/6/1987",
    "",
    "Riegle meets with Gray re: FSLIC recapitalizaiton bill",
    "Secretary says Gray's office called Riegle",
    [
      "Riegle",
      "Gray"
    ],
    ""
  ],
  [
    "3/6/1987",
    "",
    "Gray meets with Riegle to lobby for \"direct investment\" regulation",
    "At the end of the meeting, Riegle tells Gray that there are Senators that want to meet with him about the \"direct investment\" laws. According to Gray, Riegle says: \"You'll be getting a call\"",
    [
      "Riegle",
      "Gray"
    ],
    ""
  ],
  [
    "3/6/1987",
    "3/8/1987",
    "Riegle visits Lincoln in Phoenix",
    "At the end of the visit, Riegle says he will try to set up a meeting with Gray. He also offers that it would help to have constituent Senators present. During the later investigation, Riegle says that the trip to Phoenix was on the pretense of another engagement",
    [
      "Riegle",
      "Lincoln",
      "Keating"
    ],
    ""
  ],
  [
    "3/7/1987",
    "",
    "While Keating and Rielge meet privately, Grogan discusses fundraiser that Keating proposed for Riegle",
    "Held at the Ponchartrain Hotel",
    [
      "Keating",
      "Riegle",
      "Grogan"
    ],
    ""
  ],
  [
    "3/10/1987",
    "",
    "Riegle votes against cutting S&L regulatory funding",
    "",
    [
      "Riegle"
    ],
    ""
  ],
  [
    "3/13/1987",
    "",
    "Arthur Young (Attchison's) letter sent to Riegle",
    "",
    [
      "Attchison",
      "Riegle"
    ],
    ""
  ],
  [
    "3/13/1987",
    "",
    "Media: Bank Board Clears Henkel of Conflict Charge; Reagan Nominee Accused of Proposing Self-Serving Amendment",
    "The Federal Home Loan Bank Board has cleared Board member Lee Henkel of conflict-of-interest charges concerning a California savings and loan institution the Federal agency regulates, according to an internal bank board document.",
    [
      "Media"
    ],
    ""
  ],
  [
    "3/16/1987",
    "",
    "Grogan attends meeting with Cranston and Riegle",
    "Talk about America Votes",
    [
      "Cranston",
      "Riegle",
      "Grogan"
    ],
    ""
  ],
  [
    "3/16/1987",
    "3/17/1987",
    "DeConcini's office recieves Attchison letter and other evidence of mistreatment",
    "Attchison letter was originally sent to Riegle",
    [
      "DeConcini",
      "Attchison"
    ],
    ""
  ],
  [
    "3/17/1987",
    "",
    "Arthur Young (Attchison) letter sent to McCain's office",
    "VanPaasschen unaware of office receiving this letter",
    [
      "Attchison",
      "McCain",
      "VanPaasschen"
    ],
    ""
  ],
  [
    "3/17/1987",
    "",
    "ACC sends DeConcini's office info. re: regulatory problems and ACC's responses",
    "Includes memo entitled \"Talking Points for Meeting with Ed Gray.\" Written on it: \"WON'T USE\"",
    [
      "ACC",
      "DeConcini"
    ],
    ""
  ],
  [
    "3/17/1987",
    "",
    "DeConcini talks to Riegle and tells him he is having trouble with Gray",
    "Asks him if he will help. Riegle later says to have meeting with Gray",
    [
      "DeConcini",
      "Riegle"
    ],
    ""
  ],
  [
    "3/17/1987",
    "",
    "Grogan meets with Riegle and asks for invite from McCain/DeConcini to attend meeting with Gray",
    "Allegedly where Riegle tells Grogan to have DeConcini invite him",
    [
      "Riegle",
      "Grogan"
    ],
    ""
  ],
  [
    "3/19/1987",
    "",
    "Sedlmayr prepares memo re: ACC's concerns for DeConcini",
    "ACC had sent DeConcini's office a bunch of material; Sedlmayr summarizes and adds editorial to it for DeConcini (believes she did this before meeting with McCain)",
    [
      "Sedlmayr",
      "DeConcini"
    ],
    ""
  ],
  [
    "3/19/1987",
    "",
    "McCain, DeConcini, VanPaasschen, and Sedlmayr meet in McCain's office re: Keating and Gray",
    "Dicussed Keating's problems with audit and whether a meeting with Gray would be productive. McCain doesn't commit to DeConcini's suggestion to go to SF Regulators. DeConcini offers to go to Gray's office right there and then. McCain tells VanPaasschen afterwards he thinks that's inappropriate",
    [
      "McCain",
      "DeConcini",
      "VanPaasschen",
      "Sedlmayr"
    ],
    ""
  ],
  [
    "3/19/1987",
    "",
    "VanPaasschen advises McCain that meeting with Gray and the SF Regulators would be improper",
    "",
    [
      "VanPaasschen",
      "McCain"
    ],
    ""
  ],
  [
    "3/19/1987",
    "",
    "DeConcini recieves summary of Keating's positions via \"Schedule\" memo",
    "Summarized by Sedlmayr",
    [
      "DeConcini",
      "Sedlmayr",
      "Keating"
    ],
    ""
  ],
  [
    "3/20/1987",
    "",
    "DeConcini calls Gray and asks if he will meet with the Senators re: Lincoln's problems with the Bank Board",
    "Gray says he will be happy to and they set the time. \"No aides\" was not mentioned in the conversation",
    [
      "DeConcini",
      "Gray"
    ],
    ""
  ],
  [
    "3/20/1987",
    "",
    "Petition filed to recuse Gray from the Bank Board",
    "Filed by Lincoln",
    [
      "Gray"
    ],
    ""
  ],
  [
    "3/23/1987",
    "",
    "Fundraiser by Keating for Riegle held at his Ponchetrain Hotel",
    "",
    [
      "Riegle",
      "Keating"
    ],
    ""
  ],
  [
    "3/23/1987",
    "",
    "VanPaasschen has long conversation with Attchison about the legitimacy of his letter",
    "Ends conversation believing his sincerity",
    [
      "VanPaasschen",
      "Attchison"
    ],
    ""
  ],
  [
    "3/23/1987",
    "",
    "Sedlmyer tells VanPaasschen that Keating called McCain a \"wimp\" in conversaiton with DeConcini",
    "",
    [
      "Sedlmayr",
      "VanPaasschen",
      "McCain",
      "Keating"
    ],
    ""
  ],
  [
    "3/24/1987",
    "",
    "DeConcini meets with Keating",
    "Dicuss upcoming meeting with Gray",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "3/24/1987",
    "",
    "Keating and McCain meet in McCain's office",
    "McCain tells Keating he won't intervene for him. The two had a falling out",
    [
      "McCain",
      "Keating"
    ],
    ""
  ],
  [
    "3/24/1987",
    "",
    "VanPaasschen sends memo to McCain that supports Authur Young letter (after meeting with Keating)",
    "Memo includes info. that she got from Attchison: According to McCain, this research happens during the meeting with Keating (when he says he won't talk to Gray for him)",
    [
      "VanPaasschen",
      "McCain",
      "Attchison",
      "Keating"
    ],
    ""
  ],
  [
    "3/24/1987",
    "",
    "McCain terminates relationship with Keating",
    "",
    [
      "McCain",
      "Keating"
    ],
    ""
  ],
  [
    "3/27/1987",
    "",
    "Riegle votes again on the Senate floor to protect funding for S&L regulators",
    "",
    [
      "Riegle"
    ],
    ""
  ],
  [
    "3/27/1987",
    "",
    "McCain tells VanPaasschen that there is duscussion of four Senators meeting with Gray",
    "Names the four Senators that will be involved; says DeConcini agreed to discussion points",
    [
      "VanPaasschen",
      "McCain",
      "DeConcini"
    ],
    ""
  ],
  [
    "3/31/1987",
    "",
    "Media: Justice Asked to Probe Bank Board Member; Justice Asked to Probe Henkel",
    "The Justice Department has been asked to determine if a top savings and loan regulator used his government office to try to benefit an S&L that has lent him millions of dollars.",
    [
      "Media"
    ],
    ""
  ],
  [
    "4/1/1987",
    "",
    "Sedlmayr sends DeConcini memo in preparation for April 2nd meeting",
    "At request of DeConcini",
    [
      "Sedlmayr",
      "DeConcini"
    ],
    ""
  ],
  [
    "4/1/1987",
    "",
    "Date when McCain says he finds out other Senators will be at meeting with Gray",
    "",
    [
      "McCain"
    ],
    ""
  ],
  [
    "4/2/1987",
    "",
    "Media: Henkel Resigns FHLBB Post, Criticizes Justice Dept. Probe; Henkel Quits Bank Board",
    "",
    [
      "Media"
    ],
    ""
  ],
  [
    "4/2/1987",
    "",
    "Meeting 1: McCain, DeConcini, Cranston, and Glenn meet w/ Gray in DeConcini's office",
    "First of the five Senator's meetings, VanPaasschen sits outside. Riegle is not in attendance. According to Gray, Reigle first summonsed him to this meeting",
    [
      "McCain",
      "DeConcini",
      "Cranston",
      "Riegle",
      "Gray"
    ],
    ""
  ],
  [
    "4/2/1987",
    "",
    "McCain recieves memo outlining two points he can talk about in meeting with Gray (from VanPaasschen)",
    "",
    [
      "VanPaasschen",
      "McCain"
    ],
    "#19"
  ],
  [
    "4/3/1987",
    "",
    "Keating sends \"Schedule\" memo to other Senators",
    "",
    [
      "Keating",
      "Riegle",
      "McCain",
      "Glenn",
      "Cranston"
    ],
    ""
  ],
  [
    "4/3/1987",
    "",
    "Grogan goes to Washington after the first meeting to talk to all the Senators and \"keep the team together\"",
    "Keating tells him to \"keep the team together\" and tell all the Senators how important attendance at the second meeting is to Keating",
    [
      "Grogan",
      "Keating",
      "DeConcini",
      "Glenn",
      "Cranston",
      "McCain",
      "Riegle"
    ],
    ""
  ],
  [
    "4/3/1987",
    "",
    "Gray calls DeConcini to tell him that regulators will meet with Senators on the 9th",
    "DeConcini's office calls the other Senators' schedulers to let them know",
    [
      "Gray",
      "DeConcini",
      "Glenn",
      "Cranston",
      "McCain",
      "Riegle"
    ],
    ""
  ],
  [
    "4/4/1987",
    "",
    "Riegle tells DeConcini to ask Sedlmayr not to contact his office re: meetings with Gray",
    "Riegle's scheduler said he knew nothing about Riegle's involvement with the Gray meeting",
    [
      "Rielge",
      "DeConcini",
      "Sedlmayr"
    ],
    ""
  ],
  [
    "4/4/1987",
    "",
    "Sedlmayr calls friend in Riegle's office to find out about his involvement in the matter",
    "The friend says he knows nothing about the meeting. DeConcini tells Sedlmayr that Rielge asked her not to contact his office about the matter",
    [
      "Sedlmayr",
      "DeConcini",
      "Riegle"
    ],
    ""
  ],
  [
    "4/5/1987",
    "",
    "DeConcini calls Gray and tells him the Senators do want to meet with the SF Regulators",
    "Gray sets up the meeting",
    [
      "DeConcini",
      "Gray"
    ],
    ""
  ],
  [
    "4/9/1987",
    "",
    "Sedlmayr drafts letter to Riegle inviting him to second meeting, from DeConcini and McCain",
    "Letter is only signed by DeConcini; Sedlmayr later testifed she thought the letter was unusual as it was her impression that the meeting was Riegle's idea",
    [
      "DeConcini",
      "Riegle",
      "McCain",
      "Sedlmayr"
    ],
    ""
  ],
  [
    "4/9/1987",
    "",
    "Meeting 2: Five Senators meet with SF Regulators in DeConcini's office",
    "McCain only asks about length of exam and fairness; Cranston attends only part of meeting due to business on Senate floor",
    [
      "DeConcini",
      "McCain",
      "Riegle",
      "Cranston",
      "Glenn",
      "SF Regulators"
    ],
    ""
  ],
  [
    "4/9/1987",
    "",
    "Sedlmayr meets with Grogan on the day of the April 9th meeting",
    "",
    [
      "Sedlmayr",
      "Grogan"
    ],
    ""
  ],
  [
    "4/10/1987",
    "",
    "Both McCain and Glenn end all contact with Keating and SF Regulators",
    "",
    [
      "McCain",
      "Glenn",
      "Keating",
      "SF Regulators"
    ],
    ""
  ],
  [
    "4/10/1987",
    "4/14/1987",
    "Jordan visits ACC (to look at their operation and land valuation etc.)",
    "Invited by Grogan, paid for by CA Thrift and Loan who she was making a speach for",
    [
      "Jordan",
      "Lincoln",
      "Grogan"
    ],
    ""
  ],
  [
    "4/10/1987",
    "",
    "DeConcini calls Keating and tells him he can't expect much from the Bank Board",
    "",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "4/14/1987",
    "",
    "Gray sends Riegle copy of Black Transcript",
    "",
    [
      "Gray",
      "Riegle"
    ],
    ""
  ],
  [
    "4/14/1987",
    "",
    "Riegle ends all contact with Keating and SF Regulators",
    "Except to later return contributions raised by Keating in early 1988",
    [
      "Riegle"
    ],
    ""
  ],
  [
    "5/1/1987",
    "",
    "Exam Report on Lincoln issued by SF Regulators",
    "",
    [
      "SF Regulators",
      "Lincoln"
    ],
    ""
  ],
  [
    "7/1/1987",
    "",
    "Gray's term on the Bank Board ends",
    "M. Danny Wall appointed new Chairman",
    [
      "Gray",
      "FHLBB"
    ],
    ""
  ],
  [
    "7/1/1987",
    "",
    "Keating offers to raise another $150,000 for Glenn",
    "Glenn declines",
    [
      "Keating",
      "Glenn"
    ],
    ""
  ],
  [
    "7/29/1987",
    "",
    "Media: S&L Chief Says Bank Board Leaked Data to Discredit Him; S&L Executive Sues Bank Board",
    "A California savings and loan executive who has feuded for years with the Federal Home Loan Bank Board has filed suit accusing the agency of leaking confidential financial information to discredit him and ruin his business.",
    [
      "Media"
    ],
    ""
  ],
  [
    "9/24/1987",
    "",
    "Jacobson schedules meeting with Keating and Cranston for this date",
    "Jacobson says Keating is happy about Wall being appointed the new FHLBB Chairman. She then suggests that Cranston \"should ask Keating for $250,000\"",
    [
      "Jacobson",
      "Cranston",
      "Keating"
    ],
    ""
  ],
  [
    "9/28/1987",
    "",
    "Jordan hears Bank Board is making a criminal referral to the Justice Department re: Lincoln",
    "Reads it in \"National Thrift News\"",
    [
      "Jordan",
      "FHLBB",
      "Lincoln"
    ],
    ""
  ],
  [
    "12/1/1987",
    "",
    "Glenn sets up a luncheon between Keating, Wright, and himself",
    "",
    [
      "Glenn",
      "Wright",
      "Keating"
    ],
    ""
  ],
  [
    "1/12/1988",
    "",
    "Jacobson schedules dinner for Cranston and Keating",
    "Keating surprises Cranston with $500,000 in checks",
    [
      "Cranston",
      "Keating",
      "Jacobson"
    ],
    ""
  ],
  [
    "2/1/1988",
    "",
    "National Thrift News ranks Lincoln 39th of top 100 S&Ls in net worth",
    "",
    [
      "Lincoln"
    ],
    ""
  ],
  [
    "3/1/1988",
    "",
    "Sedlmayr recieves Black Transcript",
    "",
    [
      "Sedlmayr"
    ],
    ""
  ],
  [
    "4/18/1988",
    "",
    "Cranston and Grogan talk via telephone about Lincoln",
    "",
    [
      "Cranston",
      "Grogan"
    ],
    ""
  ],
  [
    "4/30/1988",
    "",
    "ACC hires Attchison",
    "For an annual salary of approximately $900,000",
    [
      "Lincoln",
      "Attchison"
    ],
    ""
  ],
  [
    "5/6/1988",
    "",
    "Jordan sends memo to Cranston re: phone call with SF Regulators",
    "SF Regulators confirm what she heard from Grogan re: the fact that they are taking aggressive action despite fraud admissions",
    [
      "Jordan",
      "Cranston",
      "SF Regulators",
      "Lincoln"
    ],
    ""
  ],
  [
    "5/14/1988",
    "",
    "Bank Board and Lincoln enter into public Memorandum of Understanding",
    "",
    [
      "FLHBB",
      "Lincoln"
    ],
    ""
  ],
  [
    "10/9/1988",
    "",
    "Media: THE SAVINGS AND LOAN CRISIS; Edwin Gray on the S&L Crisis 'This Was a Self-Inflicted Disaster'",
    "",
    [
      "Media"
    ],
    ""
  ],
  [
    "10/9/1988",
    "",
    "Media: Savings & Loans & Intrigue & 'Meddling'",
    "What was once a dirty little secret is now headline news: The American taxpayer will have to foot a bill, estimated at between $50 billion and $100 billion, to pay for the profligate pursuits of savings and loan operators.",
    [
      "Media"
    ],
    ""
  ],
  [
    "12/1/1988",
    "",
    "Keating calls DeConcini to make request (DeConcini says no)",
    "Asks for DeConcini to call new FHLBB Chairman Wall and see if he will hold the audit and push for approval of Lincoln's sale. Keating needs more time to sell the company to keep ACC viable. Instead, DeConcini just makes a status inquiry",
    [
      "Keating",
      "DeConcini",
      "Lincoln"
    ],
    ""
  ],
  [
    "12/1/1988",
    "",
    "Jordan, Cranston, and Keating have dinner",
    "Keating says he's getting out of the business",
    [
      "Jordan",
      "Cranston",
      "Keating"
    ],
    ""
  ],
  [
    "12/21/1988",
    "",
    "DeConcini sends Sedlmayr memo re: sale of Lincoln",
    "DeConcini seems to express genuine concern about general state of AZ economy, not just political favor to Keating",
    [
      "DeConcini",
      "Sedlmayr",
      "Lincoln"
    ],
    ""
  ],
  [
    "2/7/1989",
    "",
    "Jordan, DeConcini, Gottlieb (a Riegle aide), Sedlmayr, Cranston and Grogan meet in DeConcini's office re: sale of Lincoln.",
    "Grogan talks about Lincoln's intent to sell; seeking help in getting Bank Board to approve the sale",
    [
      "Grogan",
      "Sedlmayr",
      "Cranston",
      "Jordan",
      "FHLBB",
      "DeConcini",
      "Lincoln"
    ],
    ""
  ],
  [
    "2/8/1989",
    "",
    "Jordan calls Dochow (FHLBB Regulation Supervisor)",
    "Wants to check on why the Bank Board is involved in selling this early (if Lincoln is a healthy company, as she thought). Dochow says Lincoln's net worth is in dispute",
    [
      "Jordan",
      "FHLBB",
      "Lincoln"
    ],
    ""
  ],
  [
    "2/9/1989",
    "",
    "Sedlmayr sends memo to DeConcini re: meeting with Grogan",
    "Drafts talking points for call with new FHLBB Chairman Wall",
    [
      "Sedlmayr",
      "DeConcini"
    ],
    ""
  ],
  [
    "2/15/1989",
    "",
    "DeConcini calls new FHLBB Chairman Wall and other members",
    "To push for approval of sale of Lincoln",
    [
      "DeConcini",
      "Wall",
      "FHLBB",
      "Lincoln"
    ],
    ""
  ],
  [
    "5/25/1989",
    "",
    "McCain sends letter to Gray asking if his actions were improper",
    "",
    [
      "Gray",
      "McCain"
    ],
    "#24"
  ],
  [
    "5/30/1989",
    "",
    "Sedlmayr drafts response to Gray-McCain letter for DeConcini",
    "",
    [
      "Sedlmayr",
      "DeConcini"
    ],
    ""
  ],
  [
    "5/30/1989",
    "",
    "Gray responds to McCain's letter",
    "",
    [
      "Gray",
      "McCain"
    ],
    "#14"
  ],
  [
    "6/14/1989",
    "",
    "Media: THE $150 BILLION CALAMITY; Hardening the S&L Battle Lines 'You Can't Restrict Our God-Given Right to Make Profits!'",
    "",
    [
      "Media"
    ],
    ""
  ],
  [
    "6/20/1989",
    "",
    "DeConcini sends letter to Gray",
    "Says Gray's response to McCain's letter is bogus",
    [
      "DeConcini",
      "Gray"
    ],
    "LINK"
  ],
  [
    "6/20/1989",
    "",
    "McCain calls Gray about letters",
    "",
    [
      "McCain",
      "Gray"
    ],
    ""
  ],
  [
    "9/16/1989",
    "",
    "Media: $1.1 Billion Bank Fraud Suit Filed; New Rescue Agency Accuses S&L Owner of Racketeering, U.S. Regulators File Suit Against Calif. S&L Owner",
    "Federal banking regulators yesterday filed the biggest bank fraud lawsuit ever, accusing Arizona real estate developer Charles Keating and his associates of directing a racketeering scheme that destroyed…",
    [
      "Media"
    ],
    ""
  ],
  [
    "1/1/1990",
    "",
    "DeConcini returns Keating's contributions",
    "After Federal government files a lawsuit charging civil fraud. This was a campaign-wide policy of his",
    [
      "DeConcini",
      "Keating"
    ],
    ""
  ],
  [
    "3/5/1990",
    "",
    "Media: Keating, Failed King of Thrifts, Lincoln S & L's Deposed Chief, Blasting Back at the Regulators",
    "Federal officials say the taxpayer bailout of Keating's bankrupt Lincoln Savings and Loan - one of hundreds of failed thrifts nationwide - could cost every man, woman and child in America $10 each.",
    [
      "Media"
    ],
    ""
  ]
]
